greeting.message=Xin ch\u00E0o, {0}!
error.notfound=Kh\u00F4ng t\u00ECm th\u1EA5y t\u00E0i nguy\u00EAn \u0111\u01B0\u1EE3c y\u00EAu c\u1EA7u.
# SYSTEM / INFRA
system.error=\u0110\u00E3 c\u00F3 l\u1ED7i h\u1EC7 th\u1ED1ng x\u1EA3y ra. Vui l\u00F2ng th\u1EED l\u1EA1i sau.
database.error=\u0110\u00E3 c\u00F3 l\u1ED7i c\u01A1 s\u1EDF d\u1EEF li\u1EC7u x\u1EA3y ra. Vui l\u00F2ng li\u00EAn h\u1EC7 h\u1ED7 tr\u1EE3.
persistence.state.error=\u0110\u00E3 x\u1EA3y ra l\u1ED7i khi l\u01B0u tr\u1EEF d\u1EEF li\u1EC7u.
system.unsupported=T\u00EDnh n\u0103ng n\u00E0y ch\u01B0a \u0111\u01B0\u1EE3c h\u1ED7 tr\u1EE3.
i18n.no.message=Kh\u00F4ng t\u00ECm th\u1EA5y th\u00F4ng b\u00E1o cho kh\u00F3a \u0111\u00E3 cho.
# AUTH / SECURITY
auth.unauthorized=B\u1EA1n kh\u00F4ng \u0111\u01B0\u1EE3c ph\u00E9p th\u1EF1c hi\u1EC7n h\u00E0nh \u0111\u1ED9ng n\u00E0y.
auth.forbidden=B\u1EA1n kh\u00F4ng c\u00F3 quy\u1EC1n truy c\u1EADp t\u00E0i nguy\u00EAn n\u00E0y.
auth.login.failed=\u0110\u0103ng nh\u1EADp th\u1EA5t b\u1EA1i. Vui l\u00F2ng ki\u1EC3m tra l\u1EA1i t\u00EAn \u0111\u0103ng nh\u1EADp v\u00E0 m\u1EADt kh\u1EA9u.
security.invalid.signature=Ch\u1EEF k\u00FD kh\u00F4ng h\u1EE3p l\u1EC7.
# VALIDATION / INPUT
validation.failed=D\u1EEF li\u1EC7u kh\u00F4ng h\u1EE3p l\u1EC7. Vui l\u00F2ng ki\u1EC3m tra l\u1EA1i.
validation.required=Tr\u01B0\u1EDDng n\u00E0y l\u00E0 b\u1EAFt bu\u1ED9c.
validation.invalid.param=C\u00E1c tham s\u1ED1 \u0111\u01B0\u1EE3c cung c\u1EA5p kh\u00F4ng h\u1EE3p l\u1EC7.
validation.field.too_long=Gi\u00E1 tr\u1ECB c\u1EE7a tr\u01B0\u1EDDng n\u00E0y kh\u00F4ng \u0111\u01B0\u1EE3c v\u01B0\u1EE3t qu\u00E1 {max} k\u00FD t\u1EF1.
validation.field.too_short=Gi\u00E1 tr\u1ECB c\u1EE7a tr\u01B0\u1EDDng n\u00E0y ph\u1EA3i c\u00F3 \u00EDt nh\u1EA5t {min} k\u00FD t\u1EF1.
validation.field.size_not_in_range=Gi\u00E1 tr\u1ECB c\u1EE7a tr\u01B0\u1EDDng n\u00E0y ph\u1EA3i n\u1EB1m trong kho\u1EA3ng t\u1EEB {min} \u0111\u1EBFn {max}.
validation.invalid.email=\u0110\u1ECBnh d\u1EA1ng email kh\u00F4ng h\u1EE3p l\u1EC7.
validation.field.positive_or_zero=Gi\u00E1 tr\u1ECB ph\u1EA3i l\u00E0 m\u1ED9t s\u1ED1 d\u01B0\u01A1ng ho\u1EB7c b\u1EB1ng kh\u00F4ng.
validation.field.positive=Gi\u00E1 tr\u1ECB ph\u1EA3i l\u00E0 m\u1ED9t s\u1ED1 d\u01B0\u01A1ng.
validation.field.future_or_present=Ng\u00E0y ph\u1EA3i l\u00E0 ng\u00E0y hi\u1EC7n t\u1EA1i ho\u1EB7c trong t\u01B0\u01A1ng lai.
validation.field.existed=Gi\u00E1 tr\u1ECB n\u00E0y \u0111\u00E3 t\u1ED3n t\u1EA1i.
validation.enum.notFound=Gi\u00E1 tr\u1ECB \u0111\u01B0\u1EE3c ch\u1EC9 \u0111\u1ECBnh kh\u00F4ng h\u1EE3p l\u1EC7.
# ENTITY / RESOURCE
entity.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y th\u1EF1c th\u1EC3 \u0111\u01B0\u1EE3c y\u00EAu c\u1EA7u.
entity.already.exists=M\u1ED9t th\u1EF1c th\u1EC3 v\u1EDBi \u0111\u1ECBnh danh n\u00E0y \u0111\u00E3 t\u1ED3n t\u1EA1i.
resource.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y t\u00E0i nguy\u00EAn \u0111\u01B0\u1EE3c y\u00EAu c\u1EA7u.
resource.conflict=\u0110\u00E3 x\u1EA3y ra xung \u0111\u1ED9t t\u00E0i nguy\u00EAn.
# DATABASE CONSTRAINT
db.duplicate=\u0110\u00E3 t\u1ED3n t\u1EA1i m\u1ED9t t\u00E0i nguy\u00EAn tr\u00F9ng l\u1EB7p.
db.foreign.key.violation=Vi ph\u1EA1m r\u00E0ng bu\u1ED9c kh\u00F3a ngo\u1EA1i.
# BUSINESS RULE
business.operation.not.allowed=Thao t\u00E1c n\u00E0y kh\u00F4ng \u0111\u01B0\u1EE3c ph\u00E9p.
error.plan.limit.exceeded=B\u1EA1n \u0111\u00E3 \u0111\u1EA1t \u0111\u1EBFn gi\u1EDBi h\u1EA1n c\u1EE7a g\u00F3i hi\u1EC7n t\u1EA1i. Vui l\u00F2ng n\u00E2ng c\u1EA5p \u0111\u1EC3 ti\u1EBFp t\u1EE5c.
error.plan.not.configured=G\u00F3i c\u1EE7a ng\u01B0\u1EDDi d\u00F9ng ch\u01B0a \u0111\u01B0\u1EE3c c\u1EA5u h\u00ECnh.
# PASSWORD DOMAIN
password.old.invalid=M\u1EADt kh\u1EA9u c\u0169 kh\u00F4ng ch\u00EDnh x\u00E1c.
password.confirm.not.match=M\u1EADt kh\u1EA9u m\u1EDBi v\u00E0 m\u1EADt kh\u1EA9u x\u00E1c nh\u1EADn kh\u00F4ng kh\u1EDBp.
# OTP SEND
otp.send.failed=G\u1EEDi OTP th\u1EA5t b\u1EA1i. Vui l\u00F2ng th\u1EED l\u1EA1i.
otp.send.prevent=Vui l\u00F2ng \u0111\u1EE3i tr\u01B0\u1EDBc khi y\u00EAu c\u1EA7u OTP m\u1EDBi.
otp.send.limit.exceeded=B\u1EA1n \u0111\u00E3 v\u01B0\u1EE3t qu\u00E1 gi\u1EDBi h\u1EA1n y\u00EAu c\u1EA7u OTP. Vui l\u00F2ng th\u1EED l\u1EA1i sau.
# OTP VERIFY
otp.invalid=M\u00E3 OTP kh\u00F4ng h\u1EE3p l\u1EC7.
otp.expired=M\u00E3 OTP \u0111\u00E3 h\u1EBFt h\u1EA1n. Vui l\u00F2ng y\u00EAu c\u1EA7u m\u00E3 m\u1EDBi.
otp.max.attempt=B\u1EA1n \u0111\u00E3 \u0111\u1EA1t \u0111\u1EBDn s\u1ED1 l\u1EA7n x\u00E1c minh t\u1ED1i \u0111a.
otp.already.verified=M\u00E3 OTP n\u00E0y \u0111\u00E3 \u0111\u01B0\u1EE3c x\u00E1c minh.
otp.already.sent=M\u00E3 OTP n\u00E0y \u0111\u00E3 \u0111\u01B0\u1EE3c g\u1EEDi.
# PAYMENT / EXTERNAL
payment.provider.error=\u0110\u00E3 x\u1EA3y ra l\u1ED7i v\u1EDBi nh\u00E0 cung c\u1EA5p thanh to\u00E1n.
payment.system.error=\u0110\u00E3 x\u1EA3y ra l\u1ED7i h\u1EC7 th\u1ED1ng thanh to\u00E1n.
payment.provider.unavailable=Nh\u00E0 cung c\u1EA5p thanh to\u00E1n hi\u1EC7n kh\u00F4ng kh\u1EA3 d\u1EE5ng.
external.service.unavailable=M\u1ED9t d\u1ECBch v\u1EE5 b\u00EAn ngo\u00E0i hi\u1EC7n kh\u00F4ng kh\u1EA3 d\u1EE5ng.
# JSON / FORMAT
json.wrong.format=JSON \u0111\u01B0\u1EE3c cung c\u1EA5p kh\u00F4ng \u0111\u00FAng \u0111\u1ECBnh d\u1EA1ng.
# JOB / SCHEDULER
job.interrupted=T\u00E1c v\u1EE5 \u0111\u00E3 b\u1ECB gi\u00E1n \u0111o\u1EA1n.
too.many.request=\u0110\u1ECBa ch\u1EC9 IP ho\u1EB7c thi\u1EBFt b\u1ECB c\u1EE7a b\u1EA1n \u0111\u00E3 t\u1EA1m th\u1EDDi b\u1ECB ch\u1EB7n do g\u1EEDi qu\u00E1 nhi\u1EC1u y\u00EAu c\u1EA7u.
# DEFAULT
default.wallet.name=V\u00ED m\u1EB7c \u0111\u1ECBnh
default.wallet.description=V\u00ED m\u1EB7c \u0111\u1ECBnh cho ng\u01B0\u1EDDi m\u1EDBi \u0111\u0103ng k\u00FD
wallet.inactive=V\u00ED hi\u1EC7n kh\u00F4ng ho\u1EA1t \u0111\u1ED9ng
wallet.access.denied=B\u1EA1n kh\u00F4ng c\u00F3 quy\u1EC1n truy c\u1EADp v\u00ED n\u00E0y

transaction.amount.invalid=S\u1ED1 ti\u1EC1n giao d\u1ECBch kh\u00F4ng h\u1EE3p l\u1EC7
transaction.date.invalid=Ng\u00E0y giao d\u1ECBch kh\u00F4ng h\u1EE3p l\u1EC7
transaction.not.editable=Giao d\u1ECBch n\u00E0y kh\u00F4ng th\u1EC3 ch\u1EC9nh s\u1EEDa
transaction.already.deleted=Giao d\u1ECBch \u0111\u00E3 b\u1ECB xo\u00E1

wallet.insufficient.balance=S\u1ED1 d\u01B0 v\u00ED kh\u00F4ng \u0111\u1EE7

category.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y danh m\u1EE5c
category.type.invalid=Lo\u1EA1i danh m\u1EE5c kh\u00F4ng h\u1EE3p l\u1EC7
category.access.denied=B\u1EA1n kh\u00F4ng c\u00F3 quy\u1EC1n truy c\u1EADp danh m\u1EE5c n\u00E0y

recurring.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y giao d\u1ECBch \u0111\u1ECBnh k\u1EF3
recurring.category.inactive=Danh m\u1EE5c \u0111\u00E3 ch\u1ECDn kh\u00F4ng ho\u1EA1t \u0111\u1ED9ng
recurring.wallet.inactive=V\u00ED \u0111\u00E3 ch\u1ECDn kh\u00F4ng ho\u1EA1t \u0111\u1ED9ng
recurring.date.end_before_start=Ng\u00E0y k\u1EBFt th\u00FAc ph\u1EA3i sau ng\u00E0y b\u1EAFt \u0111\u1EA7u
recurring.date.next_in_past=Ng\u00E0y th\u1EF1c thi ti\u1EBFp theo kh\u00F4ng th\u1EC3 l\u00E0 ng\u00E0y trong qu\u00E1 kh\u1EE9

budget.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y ng\u00E2n s\u00E1ch
budget.duplicate=\u0110\u00E3 t\u1ED3n t\u1EA1i ng\u00E2n s\u00E1ch cho danh m\u1EE5c v\u00E0 k\u1EF3 n\u00E0y
budget.category.inactive=Danh m\u1EE5c \u0111\u00E3 ch\u1ECDn kh\u00F4ng ho\u1EA1t \u0111\u1ED9ng v\u00E0 kh\u00F4ng th\u1EC3 \u0111\u01B0\u1EE3c s\u1EED d\u1EE5ng cho ng\u00E2n s\u00E1ch
budget.date.end_before_start=Ng\u00E0y k\u1EBFt th\u00FAc ph\u1EA3i sau ng\u00E0y b\u1EAFt \u0111\u1EA7u
budget.limit.exceeded=B\u1EA1n \u0111\u00E3 \u0111\u1EA1t \u0111\u1EBFn s\u1ED1 l\u01B0\u1EE3ng ng\u00E2n s\u00E1ch t\u1ED1i \u0111a theo g\u00F3i hi\u1EC7n t\u1EA1i c\u1EE7a b\u1EA1n

# DASHBOARD / AI
dashboard.ai.system.role=B\u1EA1n l\u00E0 tr\u1EE3 l\u00FD t\u00E0i ch\u00EDnh c\u00E1 nh\u00E2n c\u1EE7a Lutaco.
dashboard.ai.system.scope=Ch\u1EC9 tr\u1EA3 l\u1EDDi c\u00E1c c\u00E2u h\u1ECFi li\u00EAn quan \u0111\u1EBFn t\u00E0i ch\u00EDnh c\u00E1 nh\u00E2n, chi ti\u00EAu, thu nh\u1EADp, ng\u00E2n s\u00E1ch, v\u00ED ti\u1EC1n, giao d\u1ECBch, dashboard, b\u00E1o c\u00E1o, ti\u1EBFt ki\u1EC7m, \u0111\u1EA7u t\u01B0, l\u00E3i su\u1EA5t v\u00E0 kho\u1EA3n vay.
dashboard.ai.system.refuse=N\u1EBFu c\u00E2u h\u1ECFi kh\u00F4ng li\u00EAn quan \u0111\u1EBDn t\u00E0i ch\u00EDnh, h\u00E3y t\u1EEB ch\u1ED1i l\u1ECBch s\u1EF1 b\u1EB1ng ti\u1EBFng Vi\u1EC7t c\u00F3 d\u1EA5u v\u00E0 g\u1EE3i \u00FD ng\u01B0\u1EDDi d\u00F9ng h\u1ECFi v\u1EC1 t\u00E0i ch\u00EDnh c\u00E1 nh\u00E2n.
dashboard.ai.system.response.language=Tr\u1EA3 l\u1EDDi b\u1EB1ng ti\u1EBFng Vi\u1EC7t c\u00F3 d\u1EA5u.
dashboard.ai.system.response.limit=\u01AFu ti\u00EAn tr\u1EA3 l\u1EDDi ng\u1EAFn g\u1ECDn, r\u00F5 r\u00E0ng, t\u1ED1i \u0111a 3 \u00FD ch\u00EDnh v\u00E0 \u0111\u1EC1 xu\u1EA5t h\u00E0nh \u0111\u1ED9ng c\u1EE5 th\u1EC3.
dashboard.ai.prompt.title=Ph\u00E2n t\u00EDch dashboard t\u00E0i ch\u00EDnh
dashboard.ai.prompt.question=C\u00E2u h\u1ECFi c\u1EE7a ng\u01B0\u1EDDi d\u00F9ng
dashboard.ai.prompt.overview=T\u00F3m t\u1EAFt t\u00E0i ch\u00EDnh hi\u1EC7n t\u1EA1i
dashboard.ai.prompt.top_expense=Top danh m\u1EE5c chi
dashboard.ai.prompt.insights=Insights hi\u1EC7n c\u00F3
dashboard.ai.prompt.output=Nhi\u1EC7m v\u1EE5: ph\u00E2n t\u00EDch d\u1EEF li\u1EC7u, gi\u1EA3i th\u00EDch ng\u1EAFn g\u1ECDn v\u00E0 \u0111\u1EC1 xu\u1EA5t h\u00E0nh \u0111\u1ED9ng th\u1EF1c t\u1EBF.
dashboard.ai.prompt.out_of_scope=Ph\u1EA1m vi kh\u00F4ng \u0111\u01B0\u1EE3c ph\u00E9p: b\u00F3i to\u00E1n, gi\u1EA3i tr\u00ED, y t\u1EBE, ph\u00E1p l\u00FD, l\u1EADp tr\u00ECnh ngo\u00E0i ng\u1EEF c\u1EA3nh t\u00E0i ch\u00EDnh ho\u1EB7c b\u1EA5t k\u1EF3 ch\u1EE7 \u0111\u1EC1 kh\u00F4ng li\u00EAn quan n\u00E0o.
dashboard.ai.prompt.reply_style=H\u00E3y tr\u1EA3 l\u1EDDi ng\u1EAFn g\u1ECDn, c\u00F3 d\u1EA5u ti\u1EBFng Vi\u1EC7t, v\u00E0 n\u1EBFu c\u1EA7n c\u00F3 th\u1EC3 th\u00EAm ti\u1EBFng Anh r\u1EA5t ng\u1EAFn trong ngo\u1EB7c.
dashboard.ai.prompt.greeting.rule=B\u1EAFt bu\u1ED9c m\u1EDF \u0111\u1EA7u c\u00E2u tr\u1EA3 l\u1EDDi b\u1EB1ng 'Ch\u00E0o {0},' v\u00E0 d\u00F9ng \u0111\u00FAng t\u00EAn n\u00E0y, kh\u00F4ng d\u00F9ng t\u00EAn m\u1EB7c \u0111\u1ECBnh.
dashboard.ai.prompt.output.format=Format b\u1EAFt bu\u1ED9c: d\u00F9ng 4 ph\u1EA7n g\u1ED3m (1) T\u1ED5ng quan ng\u1EAFn g\u1ECDn (2) \u0110i\u1EC3m t\u00EDch c\u1EF1c/ch\u01B0a t\u1ED1t (3) 3 h\u00E0nh \u0111\u1ED9ng \u0111\u00E1nh s\u1ED1 1-2-3 (4) 1 c\u00E2u k\u1EBFt th\u00FAc. Kh\u00F4ng d\u00F9ng markdown in \u0111\u1EADm.
dashboard.ai.prompt.no_data=Kh\u00F4ng c\u00F3 d\u1EEF li\u1EC7u.
dashboard.ai.prompt.no_insight=Kh\u00F4ng c\u00F3 insight.
dashboard.ai.prompt.truncated=Ph\u1EA7n n\u1ED9i dung \u0111\u00E3 \u0111\u01B0\u1EE3c r\u00FAt g\u1ECDn \u0111\u1EC3 ph\u00F9 h\u1EE3p gi\u1EDBi h\u1EA1n prompt AI.
dashboard.ai.fallback=T\u1EA1m th\u1EDDi ch\u01B0a th\u1EC3 ph\u00E2n t\u00EDch b\u1EB1ng AI. H\u00E3y th\u1EED l\u1EA1i sau.
dashboard.ai.fallback.summary=T\u00F3m t\u1EAFt nhanh t\u1EEB h\u1EC7 th\u1ED1ng
ai.message.blank=N\u1ED9i dung b\u1EA1n g\u1EEDi cho AI kh\u00F4ng \u0111\u01B0\u1EE3c \u0111\u1EC3 tr\u1ED1ng.
ai.message.too_long=N\u1ED9i dung b\u1EA1n g\u1EEDi cho AI \u0111\u00E3 v\u01B0\u1EE3t qu\u00E1 \u0111\u1ED9 d\u00E0i cho ph\u00E9p.
ai.message.out_of_scope=C\u00E2u h\u1ECFi n\u00E0y kh\u00F4ng thu\u1ED9c ph\u1EA1m vi t\u00E0i ch\u00EDnh c\u00E1 nh\u00E2n. Vui l\u00F2ng h\u1ECFi v\u1EC1 chi ti\u00EAu, thu nh\u1EADp, ng\u00E2n s\u00E1ch, v\u00ED ti\u1EC1n, giao d\u1ECBch, dashboard ho\u1EB7c b\u00E1o c\u00E1o.

dashboard.insight.expense.increase.message=Chi ti\u00EAu t\u0103ng {0}% so v\u1EDBi k\u1EF3 tr\u01B0\u1EDBc.
dashboard.insight.expense.increase.recommendation=C\u1EA7n r\u00E0 so\u00E1t c\u00E1c kho\u1EA3n chi bi\u1EBFn \u0111\u1ED9ng v\u00E0 \u0111\u1EB7t l\u1EA1i h\u1EA1n m\u1EE9c theo danh m\u1EE5c.
dashboard.insight.expense.increase.danger=Chi ti\u00EAu t\u0103ng m\u1EA1nh {0}% so v\u1EDBi k\u1EF3 tr\u01B0\u1EDBc.
dashboard.insight.expense.increase.danger.recommendation=N\u00EAn gi\u1EA3m ngay c\u00E1c kho\u1EA3n chi kh\u00F4ng thi\u1EBFt y\u1EBFu v\u00E0 theo d\u00F5i ng\u00E2n s\u00E1ch h\u1EB1ng ng\u00E0y.
dashboard.insight.expense.decrease.message=Chi ti\u00EAu gi\u1EA3m {0}% so v\u1EDBi k\u1EF3 tr\u01B0\u1EDBc.
dashboard.insight.expense.decrease.recommendation=\u0110ang ki\u1EC3m so\u00E1t chi ti\u00EAu t\u1ED1t, h\u00E3y ti\u1EBFp t\u1EE5c duy tr\u00EC k\u1EBE ho\u1EA1ch.
dashboard.insight.income.increase.message=Thu nh\u1EADp t\u0103ng {0}% so v\u1EDBi k\u1EF3 tr\u01B0\u1EDBc.
dashboard.insight.income.increase.recommendation=N\u00EAn tr\u00EDch m\u1ED9t ph\u1EA7n thu nh\u1EADp t\u0103ng th\u00EAm v\u00E0o qu\u1EF9 d\u1EF1 ph\u00F2ng ho\u1EB7c \u0111\u1EA7u t\u01B0.
dashboard.insight.income.decrease.message=Thu nh\u1EADp gi\u1EA3m {0}% so v\u1EDBi k\u1EF3 tr\u01B0\u1EDBc.
dashboard.insight.income.decrease.recommendation=C\u1EA7n theo d\u00F5i d\u00F2ng ti\u1EC1n v\u00E0o v\u00E0 \u01B0u ti\u00EAn c\u00E1c kho\u1EA3n chi thi\u1EBFt y\u1EBFu.
dashboard.insight.balance.negative.message=T\u1ED5ng s\u1ED1 d\u01B0 hi\u1EC7n t\u1EA1i \u0111ang \u00E2m {0} VND.
dashboard.insight.balance.negative.recommendation=C\u1EA7n n\u1EA1p th\u00EAm ti\u1EC1n ho\u1EB7c \u0111i\u1EC1u ch\u1EC9nh chi ti\u00EAu ngay \u0111\u1EC3 tr\u00E1nh m\u1EA5t c\u00E2n \u0111\u1ED1i d\u00F2ng ti\u1EC1n.
dashboard.insight.category.dominant.message=M\u1ED9t danh m\u1EE5c \u0111ang chi\u1EBFm {0}% t\u1ED5ng chi ti\u00EAu.
dashboard.insight.category.dominant.recommendation=N\u00EAn \u0111\u1EB7t budget ri\u00EAng cho danh m\u1EE5c n\u00E0y \u0111\u1EC3 ki\u1EC3m so\u00E1t t\u1ED1t h\u01A1n.

ai.image.too_large=H\u00ECnh \u1EA3nh t\u1EA3i l\u00EAn kh\u00F4ng \u0111\u01B0\u1EE3c v\u01B0\u1EE3t qu\u00E1 10 MB.
ai.image.invalid=Vui l\u00F2ng t\u1EA3i l\u00EAn m\u1ED9t t\u1EC7p h\u00ECnh \u1EA3nh h\u1EE3p l\u1EC7.
