greeting.message=Xin ch\u00E0o, {0}!
error.notfound=Kh\u00F4ng t\u00ECm th\u1EA5y t\u00E0i nguy\u00EAn \u0111\u01B0\u1EE3c y\u00EAu c\u1EA7u.
# SYSTEM / INFRA
system.error=\u0110\u00E3 c\u00F3 l\u1ED7i h\u1EC7 th\u1ED1ng x\u1EA3y ra. Vui l\u00F2ng th\u1EED l\u1EA1i sau.
database.error=\u0110\u00E3 c\u00F3 l\u1ED7i c\u01A1 s\u1EDF d\u1EEF li\u1EC7u x\u1EA3y ra. Vui l\u00F2ng li\u00EAn h\u1EC7 h\u1ED7 tr\u1EE3.
persistence.state.error=\u0110\u00E3 x\u1EA3y ra l\u1ED7i khi l\u01B0u tr\u1EEF d\u1EEF li\u1EC7u.
system.unsupported=T\u00EDnh n\u0103ng n\u00E0y ch\u01B0a \u0111\u01B0\u1EE3c h\u1ED7 tr\u1EE3.
i18n.no.message=Kh\u00F4ng t\u00ECm th\u1EA5y th\u00F4ng b\u00E1o cho kh\u00F3a \u0111\u00E3 cho.
# AUTH / SECURITY
auth.unauthorized=B\u1EA1n kh\u00F4ng \u0111\u01B0\u1EE3c ph\u00E9p th\u1EF1c hi\u1EC7n h\u00E0nh \u0111\u1ED9ng n\u00E0y.
auth.forbidden=B\u1EA1n kh\u00F4ng c\u00F3 quy\u1EC1n truy c\u1EADp t\u00E0i nguy\u00EAn n\u00E0y.
auth.login.failed=\u0110\u0103ng nh\u1EADp th\u1EA5t b\u1EA1i. Vui l\u00F2ng ki\u1EC3m tra l\u1EA1i t\u00EAn \u0111\u0103ng nh\u1EADp v\u00E0 m\u1EADt kh\u1EA9u.
security.invalid.signature=Ch\u1EEF k\u00FD kh\u00F4ng h\u1EE3p l\u1EC7.
# VALIDATION / INPUT
validation.failed=D\u1EEF li\u1EC7u kh\u00F4ng h\u1EE3p l\u1EC7. Vui l\u00F2ng ki\u1EC3m tra l\u1EA1i.
validation.required=Tr\u01B0\u1EDDng n\u00E0y l\u00E0 b\u1EAFt bu\u1ED9c.
validation.invalid.param=C\u00E1c tham s\u1ED1 \u0111\u01B0\u1EE3c cung c\u1EA5p kh\u00F4ng h\u1EE3p l\u1EC7.
validation.field.too_long=Gi\u00E1 tr\u1ECB c\u1EE7a tr\u01B0\u1EDDng n\u00E0y kh\u00F4ng \u0111\u01B0\u1EE3c v\u01B0\u1EE3t qu\u00E1 {max} k\u00FD t\u1EF1.
validation.field.too_short=Gi\u00E1 tr\u1ECB c\u1EE7a tr\u01B0\u1EDDng n\u00E0y ph\u1EA3i c\u00F3 \u00EDt nh\u1EA5t {min} k\u00FD t\u1EF1.
validation.field.size_not_in_range=Gi\u00E1 tr\u1ECB c\u1EE7a tr\u01B0\u1EDDng n\u00E0y ph\u1EA3i n\u1EB1m trong kho\u1EA3ng t\u1EEB {min} \u0111\u1EBFn {max}.
validation.invalid.email=\u0110\u1ECBnh d\u1EA1ng email kh\u00F4ng h\u1EE3p l\u1EC7.
validation.field.positive_or_zero=Gi\u00E1 tr\u1ECB ph\u1EA3i l\u00E0 m\u1ED9t s\u1ED1 d\u01B0\u01A1ng ho\u1EB7c b\u1EB1ng kh\u00F4ng.
validation.field.positive=Gi\u00E1 tr\u1ECB ph\u1EA3i l\u00E0 m\u1ED9t s\u1ED1 d\u01B0\u01A1ng.
validation.field.future_or_present=Ng\u00E0y ph\u1EA3i l\u00E0 ng\u00E0y hi\u1EC7n t\u1EA1i ho\u1EB7c trong t\u01B0\u01A1ng lai.
validation.field.existed=Gi\u00E1 tr\u1ECB n\u00E0y \u0111\u00E3 t\u1ED3n t\u1EA1i.
validation.enum.notFound=Gi\u00E1 tr\u1ECB \u0111\u01B0\u1EE3c ch\u1EC9 \u0111\u1ECBnh kh\u00F4ng h\u1EE3p l\u1EC7.
# ENTITY / RESOURCE
entity.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y th\u1EF1c th\u1EC3 \u0111\u01B0\u1EE3c y\u00EAu c\u1EA7u.
entity.already.exists=M\u1ED9t th\u1EF1c th\u1EC3 v\u1EDBi \u0111\u1ECBnh danh n\u00E0y \u0111\u00E3 t\u1ED3n t\u1EA1i.
resource.not.found=Kh\u00F4ng t\u00ECm th\u1EA5y t\u00E0i nguy\u00EAn \u0111\u01B0\u1EE3c y\u00EAu c\u1EA7u.
resource.conflict=\u0110\u00E3 x\u1EA3y ra xung \u0111\u1ED9t t\u00E0i nguy\u00EAn.
# DATABASE CONSTRAINT
db.duplicate=\u0110\u00E3 t\u00ECm th\u1EA5y m\u1ED9t t\u00E0i nguy\u00EAn tr\u00F9ng l\u1EB7p.
db.foreign.key.violation=Vi ph\u1EA1m r\u00E0ng bu\u1ED9c kh\u00F3a ngo\u1EA1i.
# BUSINESS RULE
business.operation.not.allowed=Thao t\u00E1c n\u00E0y kh\u00F4ng \u0111\u01B0\u1EE3c ph\u00E9p.
error.plan.limit.exceeded=B\u1EA1n \u0111\u00E3 \u0111\u1EA1t \u0111\u1EBFn gi\u1EDBi h\u1EA1n c\u1EE7a g\u00F3i hi\u1EC7n t\u1EA1i. Vui l\u00F2ng n\u00E2ng c\u1EA5p \u0111\u1EC3 ti\u1EBFp t\u1EE5c.
error.plan.not.configured=G\u00F3i c\u1EE7a ng\u01B0\u1EDDi d\u00F9ng ch\u01B0a \u0111\u01B0\u1EE3c c\u1EA5u h\u00ECnh.
# PASSWORD DOMAIN
password.old.invalid=M\u1EADt kh\u1EA9u c\u0169 kh\u00F4ng ch\u00EDnh x\u00E1c.
password.confirm.not.match=M\u1EADt kh\u1EA9u m\u1EDBi v\u00E0 m\u1EADt kh\u1EA9u x\u00E1c nh\u1EADn kh\u00F4ng kh\u1EDBp.
# OTP SEND
otp.send.failed=G\u1EEDi OTP th\u1EA5t b\u1EA1i. Vui l\u00F2ng th\u1EED l\u1EA1i.
otp.send.prevent=Vui l\u00F2ng \u0111\u1EE3i tr\u01B0\u1EDBc khi y\u00EAu c\u1EA7u OTP m\u1EDBi.
otp.send.limit.exceeded=B\u1EA1n \u0111\u00E3 v\u01B0\u1EE3t qu\u00E1 gi\u1EDBi h\u1EA1n y\u00EAu c\u1EA7u OTP. Vui l\u00F2ng th\u1EED l\u1EA1i sau.
# OTP VERIFY
otp.invalid=M\u00E3 OTP kh\u00F4ng h\u1EE3p l\u1EC7.
otp.expired=M\u00E3 OTP \u0111\u00E3 h\u1EBFt h\u1EA1n. Vui l\u00F2ng y\u00EAu c\u1EA7u m\u00E3 m\u1EDBi.
otp.max.attempt=B\u1EA1n \u0111\u00E3 \u0111\u1EA1t \u0111\u1EBFn s\u1ED1 l\u1EA7n x\u00E1c minh t\u1ED1i \u0111a.
otp.already.verified=M\u00E3 OTP n\u00E0y \u0111\u00E3 \u0111\u01B0\u1EE3c x\u00E1c minh.
otp.already.sent=M\u00E3 OTP n\u00E0y \u0111\u00E3 \u0111\u01B0\u1EE3c g\u1EEDi.
# PAYMENT / EXTERNAL
payment.provider.error=\u0110\u00E3 x\u1EA3y ra l\u1ED7i v\u1EDBi nh\u00E0 cung c\u1EA5p thanh to\u00E1n.
payment.system.error=\u0110\u00E3 x\u1EA3y ra l\u1ED7i h\u1EC7 th\u1ED1ng thanh to\u00E1n.
payment.provider.unavailable=Nh\u00E0 cung c\u1EA5p thanh to\u00E1n hi\u1EC7n kh\u00F4ng kh\u1EA3 d\u1EE5ng.
external.service.unavailable=M\u1ED9t d\u1ECBch v\u1EE5 b\u00EAn ngo\u00E0i hi\u1EC7n kh\u00F4ng kh\u1EA3 d\u1EE5ng.
# JSON / FORMAT
json.wrong.format=JSON \u0111\u01B0\u1EE3c cung c\u1EA5p kh\u00F4ng \u0111\u00FAng \u0111\u1ECBnh d\u1EA1ng.
# JOB / SCHEDULER
job.interrupted=T\u00E1c v\u1EE5 \u0111\u00E3 b\u1ECB gi\u00E1n \u0111o\u1EA1n.
too.many.request=\u0110\u1ECBa ch\u1EC9 IP ho\u1EB7c thi\u1EBFt b\u1ECB c\u1EE7a b\u1EA1n \u0111\u00E3 t\u1EA1m th\u1EDDi b\u1ECB ch\u1EB7n do g\u1EEDi qu\u00E1 nhi\u1EC1u y\u00EAu c\u1EA7u.